{
  "skills": [
    {
      "id": 0,
      "skillName": "🛠️ Python",
      "amount": "100",
      "details": "At university, I acquired proficiency in Python, which has become my primary runtime for AWS Lambda scripts. Leveraging Python's versatility, I streamline processes and enhance efficiency in my DevOps role, utilizing its capabilities for automation tasks and script development."
    },
    {
      "id": 2,
      "skillName": "🖥️ Terraform",
      "amount": "100",
      "details": "I am a HashiCorp Certified: Terraform Associate, with a year's worth of experience configuring, deploying and maintaining AWS cloud resources through this Infrastructre-as-Code tool."
    },
    {
      "id": 3,
      "skillName": "🌐 Amazon Web Services (AWS)",
      "amount": "100",
      "details": "The AWS cloud services I work with on a regular include AWS Systems Manager, AWS Lambda, Simple Storage Service (S3), Elastic Cloud Compute (EC2), Amplify, Route53 (DNS service) and their associated networking components such as virtual private clouds (VPCs), security groups, subnets, loadbalancers and autoscaling groups. I'm AWS Cloud Practitioner and Solutions Architect Associate Certified and I am currently working on attaining the AWS SysOps Administrator Associate Certificate."
    },
    {
      "id": 4,
      "skillName": "🧰 Git", 
      "amount": "100",
      "details": "I've gained expertise in source control and software project management fundamentals. Git is my go-to tool for managing repositories locally and on platforms like GitHub. Check out my GitHub activity at: https://github.com/LokoMoloko98. I'm proficient with GitHub and AWS CodeCommit for seamless collaboration."
    },
    {
      "id": 5,
      "skillName": "📦 Docker", 
      "amount": "100",
      "details": "My containerisation picked up pace at Barefoot Cyber where I did ample work configuring a template docker-compose file that deploys a network of containers that compose of a Wazuh Server, Opensearch server, Kibana Dashboard and an Nginx server that acts as a proxy and loadbalancer (the main components of the SIEM) respectively."
    }
  ]
}
